;; -*- no-byte-compile: t; -*-
;;; private/edits/packages.el

(package! zop-to-char
  :pin "00152aa666354b27e56e20565f186b363afa0dce"
  :recipe (:host github :repo "thierryvolpiatto/zop-to-char"))

(package! avy
  :pin "e92cb37457b43336b765630dbfbea8ba4be601fa"
  :recipe (:host github :repo "abo-abo/avy"))

(package! aggressive-indent
  :pin "cb416faf61c46977c06cf9d99525b04dc109a33c"
  :recipe (:host github :repo "Malabarba/aggressive-indent-mode"))

(package! beginend
  :pin "4b4e4808dc3248ea61b3d8bdd7c6b73edd3b6902"
  :recipe (:host github :repo "DamienCassou/beginend"))

(package! expand-region
  :pin "95a773bd8f557cbd43d3b2dab2fa4417ec5927ab"
  :recipe (:host github :repo "magnars/expand-region.el"))


(package! flyspell-correct
  :pin "2e098db03cba74149257e31213097d043780e80a"
  :recipe (:host github :repo "d12frosted/flyspell-correct"))

(package! hungry-delete
  :pin "d919e555e5c13a2edf4570f3ceec84f0ade71657"
  :recipe (:host github :repo "nflath/hungry-delete"))

(package! imenu-anywhere
  :pin "06ec33d79e33edf01b9118aead1eabeae8ee08b1"
  :recipe (:host github :repo "vspinu/imenu-anywhere"))

(package! imenu-list
  :pin "76f2335ee6f2f066d87fe4e4729219d70c9bc70d"
  :recipe (:host github :repo "bmag/imenu-list"))

(package! mwim
  :pin "b4f3edb4c0fb8f8b71cecbf8095c2c25a8ffbf85"
  :recipe (:host github :repo "alezost/mwim.el"))

(package! fancy-narrow
  :pin "c9b3363752c09045b8ce7a2635afae42d2ae63c7"
  :recipe (:host github :repo "Malabarba/fancy-narrow"))
